app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "album11"], ["created_at", "2015-12-02 04:50:55.520823"], ["updated_at", "2015-12-02 04:50:55.520823"]]

  def destroy
    @album.destroy
---
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 1]]

    def set_album
      @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 3]]