app/controllers/musics_controller.rb

  def index
    @musics = Music.all
---
SELECT "musics".* FROM "musics"  ORDER BY album.title

  def new
    @music = Music.new
    @albums = Album.all
---
SELECT "albums".* FROM "albums"

  def create
    @music = Music.new(music_params)

    respond_to do |format|
      if @music.save
---
INSERT INTO "musics" ("title", "author", "kind", "album_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Oi "], ["author", "Autor"], ["kind", "rock"], ["album_id", 0], ["created_at", "2015-12-02 04:36:36.671429"], ["updated_at", "2015-12-02 04:36:36.671429"]]

  def update
    respond_to do |format|
      if @music.update(music_params)
---
UPDATE "musics" SET "album_id" = ?, "updated_at" = ? WHERE "musics"."id" = ?  [["album_id", 9], ["updated_at", "2015-12-03 02:28:05.253656"], ["id", 8]]

  def destroy
    @music.destroy
---
DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 1]]

    def set_music
      @music = Music.find(params[:id])
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", 8]]