app/controllers/playlists_controller.rb

  def index
    @playlists = Playlist.all
    if user_signed_in?
      @own_playlists = current_user.playlists
      @not_own_playlists = Playlist.where private: "não"
      @not_own_playlists = @not_own_playlists.where.not user_id: current_user.id
---
SELECT "playlists".* FROM "playlists"
SELECT "playlists".* FROM "playlists" WHERE "playlists"."private" = ?  [["private", "sim"]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."private" = ? AND ("playlists"."user_id" != ?)  [["private", "não"], ["user_id", 0]]

  def create
    @playlist = current_user.playlists.build(playlist_params)

    respond_to do |format|
      if @playlist.save
---
INSERT INTO "playlists" ("title", "description", "user_id", "private", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Teste"], ["description", "teste"], ["user_id", 1], ["private", "sim"], ["created_at", "2015-12-02 15:39:35.273363"], ["updated_at", "2015-12-02 15:39:35.273363"]]

  def update
    respond_to do |format|
      if @playlist.update(playlist_params)
---
UPDATE "playlists" SET "description" = ?, "updated_at" = ? WHERE "playlists"."id" = ?  [["description", "As melhores que eu tenho"], ["updated_at", "2015-12-02 20:16:11.424214"], ["id", 3]]

  def destroy
    @playlist.destroy
---
DELETE FROM "playlists" WHERE "playlists"."id" = ?  [["id", 1]]

    def set_playlist
      @playlist = Playlist.find(params[:id])
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", 6]]