app/views/playlists/show.html.erb

SELECT  "musics".* FROM "musics" INNER JOIN "musics_playlists" ON "musics"."id" = "musics_playlists"."music_id" WHERE "musics_playlists"."playlist_id" = ?  ORDER BY "musics"."id" ASC LIMIT 1  [["playlist_id", 3]]
---

<% @playlist.musics.each do |music| %>